src/DataProcessors/ПланированиеИндивидуальногоГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ПланированиеИндивидуальногоГрафика</Name>
			<Comment>Планирование графика работы сотрудников</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Enums/ДоступныеПериодыОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДоступныеПериодыОтчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйПериод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СтруктурныеЕдиницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтруктурныеЕдиницы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦенРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЯндексКарты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиЯндексКарты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисSMSРассылки</Name>
					<Comment>Сервис SMS-Рассылки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторСтруктурнойЕдиницы</Name>
					<Comment>Необходим для онлайн-записи для выгрузки в reservi</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасписаниеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ПланированиеИндивидуальногоГрафика/Forms/ФормаСоздания/Ext/Form/Module.bsl
&НаКлиенте
Перем РежимПланированияРабочихДнейПред; // Хранит пред. выбранный режим планирования работы.

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик при создании формы на сервере
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Сотрудник"          , Сотрудник);
	Параметры.Свойство("СтартоваяДата"      , СтартоваяДата);
	Параметры.Свойство("ПериодЗаполнения"   , ПериодЗаполнения);
	Параметры.Свойство("ИнтервалыРаботы"	, ИнтервалыРаботыОтбор);
	
	ПараметрыСозданияЭлементовФормы = Новый Структура;
	ПараметрыСозданияЭлементовФормы.Вставить("ГруппаЭлементов"           ,"ГруппаДеньВремя_");
	ПараметрыСозданияЭлементовФормы.Вставить("ПолеДня"                   ,"День_");
    ПараметрыСозданияЭлементовФормы.Вставить("ПолеВремени"               ,"Время_");
    ПараметрыСозданияЭлементовФормы.Вставить("КнопкаУдаленияЭлементов"   ,"УдалитьВремяЗаполнения_");
	
	СтруктурнаяЕдиница            	= ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ВремяРаботыСтруктурнойЕдиницы 	= Новый ФиксированныйМассив(Справочники.СтруктурныеЕдиницы.РабочиеДниСтруктурнойЕдиницы(СтруктурнаяЕдиница,, Истина));
	РежимПланированияРабочихДней 	= 2;
	
	// Создаем элемент предопределенных периодов
	Если ЗначениеЗаполнено(СтартоваяДата) Тогда
		СоздатьДинамическиеЭлементыПериодовЗаполнения(,,СтартоваяДата, ИнтервалыРаботыОтбор);
	Иначе
		СоздатьДинамическиеЭлементыПериодовЗаполнения();
	КонецЕсли;
	
	// Формируем заголовко окна
	ЭтаФорма.Заголовок = "Планирование работы с " + Формат(ПериодЗаполнения.ДатаНачала, "ДФ='dd MMMM yyyy'") + " до " + Формат(ПериодЗаполнения.ДатаОкончания, "ДФ='dd MMMM yyyy'");
	// В зависимости от предопределенных данных управляем состояние элементов формы
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Если Сотрудник.ЭтоГруппа = Ложь Тогда
			Элементы.Сотрудник.Видимость = Ложь;
		Иначе
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Родитель", Сотрудник);
			НовыйМассив   = Новый Массив();
			НовыйМассив.Добавить(НовыйПараметр);
			НовыеПараметры                     = Новый ФиксированныйМассив(НовыйМассив);
			Элементы.Сотрудник.ПараметрыВыбора = НовыеПараметры;			
			Сотрудник                          = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.КомандаЕще.Доступность = НЕ РежимПланированияРабочихДней = 2;
	
КонецПроцедуры

&НаКлиенте
// Обработчик при открытии формы на клиенте
// 
Процедура ПриОткрытии(Отказ)
	
	РежимПланированияРабочихДнейПред = РежимПланированияРабочихДней;
	
КонецПроцедуры

&НаКлиенте
// Обработчик оповещения
// 
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПриИзмененииШаблоновИнтерваловВремени" Тогда
		ОбновитьСпискиБыстрогоВыбораПолейВременныхИнтервалов();		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// При изменении режим планирования работы
// 
Процедура РежимПланированияРабочихДнейПриИзменении(Элемент)
	
	// Если таблица планирования времени была заполнена
	// необходимо ее очистить. Задаем вопрос.
	Если РежимПланированияРабочихДнейПред <> РежимПланированияРабочихДней
		И ВремяПланирования.Количество() > 1 Тогда
		
		ОписаниеО = Новый ОписаниеОповещения("РежимПланированияРабочихДнейПриИзмененииПослеОтвета",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеО,"Периода планирования будут удалены. Продолжить?",РежимДиалогаВопрос.ДаНет);
	Иначе
		РежимПланированияРабочихДнейПриИзмененииПослеОтвета(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;	
	
	ЭтаФорма.Ширина = 58;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик кнопки формирования таблицы результирующих данных и закрытия формы
// 
Процедура СоздатьЗанятия(Команда)
	
	// Проверка верности ввода данных	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		ПоказатьПредупреждение(,"Укажите сотрудника, для которого производится планирование!");
		Возврат;
	КонецЕсли;	
	
	Если ВремяПланирования.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Укажите временные периоды планирования рабочего времени!");
		Возврат;
	КонецЕсли;	

	ЕстьРабочееВремя = Ложь;
	Для Каждого СтрокаВП ИЗ ВремяПланирования Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаВП.Дата) Тогда
			ПоказатьПредупреждение(,"В одном из периодов не указан день планирования!");
			Возврат;	
		КонецЕсли;
		
		Если РежимПланированияРабочихДней = 0 И СтрокаВП.ИнтервалыРаботы.Количество() = 0 Тогда
			ПоказатьПредупреждение(,"В одном из периодов не указан интервал рабочего времи!");
			Возврат;	
		Иначе
			ЕстьРабочееВремя = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьРабочееВремя = Ложь Тогда
		ПоказатьПредупреждение(,"Ни в одном из периодов не указан интервал рабочего времени!");
		Возврат;	
	КонецЕсли;
	
	Если НЕ ИнтервалыАктуальныДляГрафикаРаботыСЕ() Тогда 
		Возврат;
	КонецЕсли;	

	// Режим планирования по дням недели 
	Если РежимПланированияРабочихДней = 0 Тогда	
		// Подготовить результат планирования
		ТекущийДень = ПериодЗаполнения.ДатаНачала;
		// Проход по всему периоду заполнения
		Пока ТекущийДень <= ПериодЗаполнения.ДатаОкончания Цикл
			// Выбираем только текущий по верхнему циклу день недели
			Для Каждого СтрокаВП ИЗ ВремяПланирования Цикл				
				Если ДеньНедели(СтрокаВП.Дата) = ДеньНедели(ТекущийДень) Тогда
					НоваяСтрока                       = РезультатПланирования.Добавить();
					НоваяСтрока.Дата                  = ТекущийДень; 
					НоваяСтрока.ИнтервалыРаботы       = СтрокаВП.ИнтервалыРаботы;
					НоваяСтрока.ИнтервалыРаботыПредст = СтрокаВП.ИнтервалыРаботыПредст;
					НоваяСтрока.СуммаРабочегоВремени  = СуммаИнтерваловВМинутах(СтрокаВП.ИнтервалыРаботы);
					НоваяСтрока.Сотрудник             = Сотрудник;
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
			ТекущийДень = ТекущийДень + 86400;
		КонецЦикла;		
		
		// Режим циклического планирования(смены)	
	ИначеЕсли РежимПланированияРабочихДней = 1 ИЛИ РежимПланированияРабочихДней = 2 Тогда
		
		// Подготовить результат планирования
		ТекущийДень      = ВремяПланирования[0].Дата;
		ТекНомерСтрокиВП = 0;
		// Проход по планируемому периоду
		Пока ТекущийДень <= ?(РежимПланированияРабочихДней = 2, ВремяПланирования[0].Дата, ПериодЗаполнения.ДатаОкончания) Цикл
			
			// Если это рабочий день в цикле
			СтрокаВП = ВремяПланирования[ТекНомерСтрокиВП];
			Если СтрокаВП.ИнтервалыРаботы.Количество() > 0 Тогда				
				НоваяСтрока                       = РезультатПланирования.Добавить();
				НоваяСтрока.Дата                  = ТекущийДень; 
				НоваяСтрока.ИнтервалыРаботы       = СтрокаВП.ИнтервалыРаботы;
				НоваяСтрока.ИнтервалыРаботыПредст = СтрокаВП.ИнтервалыРаботыПредст;
				НоваяСтрока.СуммаРабочегоВремени  = СуммаИнтерваловВМинутах(СтрокаВП.ИнтервалыРаботы);
				НоваяСтрока.Сотрудник             = Сотрудник;
			КонецЕсли;	
			
			ТекНомерСтрокиВП = ТекНомерСтрокиВП + 1;
			// Если дошли до конечной итерации цикла
			Если ТекНомерСтрокиВП >= ВремяПланирования.Количество() Тогда
				ТекНомерСтрокиВП = 0;
			КонецЕсли;
			
			ТекущийДень = ТекущийДень + 86400;
		КонецЦикла;
		
	КонецЕсли;
		
	ЭтаФорма.Закрыть(РезультатПланирования);
	
КонецПроцедуры

&НаКлиенте
//  Добавить время нового визита
// 
Процедура КомандаЕще(Команда)	
	
	СоздатьДинамическиеЭлементыПериодовЗаполнения(,,СледующийРабочийДень(), ПоследниеВыбранныеИнтервалыВремени());	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Обработчик события, после ответа на вопрос при изменении выбора режима периода 
// 
Процедура РежимПланированияРабочихДнейПриИзмененииПослеОтвета(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ИнтервалыРаботыЗп = Неопределено;
		Если ВремяПланирования.Количество() > 0 Тогда
			ИнтервалыРаботыЗп  = ВремяПланирования[0].ИнтервалыРаботы;
			Если ИнтервалыРаботыЗп.Количество() = 0 И НЕ ИнтервалыРаботыОтбор.Количество() = 0 Тогда 
				ИнтервалыРаботыЗп = ИнтервалыРаботыОтбор;
			КонецЕсли;	
		КонецЕсли;
		// Формируем массив ИД данных для удаления
		МассивИД = Новый Массив;
		Для А = 0 По ВремяПланирования.Количество() -1 Цикл
			МассивИД.Добавить(ВремяПланирования[А].ПолучитьИдентификатор());
		КонецЦикла;	
		// Удаляем данные и дин. элементы
		УдалитьДинамическиеЭлементыПериодовЗаполнения(МассивИД);
		
		// Добавляем первую строку
		СоздатьДинамическиеЭлементыПериодовЗаполнения(,,СтартоваяДата,ИнтервалыРаботыЗп);
		
		Элементы.КомандаЕще.Доступность = НЕ РежимПланированияРабочихДней = 2;
		
		РежимПланированияРабочихДнейПред = РежимПланированияРабочихДней;
	Иначе
		РежимПланированияРабочихДней = РежимПланированияРабочихДнейПред;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция - Интервалы актуальны для графика работы СЕ
// 
// Возвращаемое значение:
//   - 
// 
Функция  ИнтервалыАктуальныДляГрафикаРаботыСЕ()
	
	Флаг = Истина;
	
	Для Каждого СтрокаВП ИЗ ВремяПланирования Цикл
		Для Каждого СтрокаРабДеньСЕ Из ВремяРаботыСтруктурнойЕдиницы Цикл
			Если РежимПланированияРабочихДней = 0 Тогда 
				ДатаСравнения = СтрокаВП.Дата;
			Иначе 
				ДатаСравнения = Дата(2001, 01, ДеньНедели(СтрокаВП.Дата));
			КонецЕсли;	
			Если ДатаСравнения = СтрокаРабДеньСЕ.ДеньНедели Тогда 
				Для Каждого ЭлементИнтервал Из СтрокаВП.ИнтервалыРаботы Цикл 
					Если ЭлементИнтервал.Значение.НачалоРаботы < СтрокаРабДеньСЕ.ДатаНачала ИЛИ ЭлементИнтервал.Значение.ОкончаниеРаботы > СтрокаРабДеньСЕ.ДатаОкончания Тогда 
						Флаг = Ложь;
						ТекстСообщения = "Выбраные интервал(ы) работы не входит(ят) в интервал работы клиники организации в указаный день.";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВремяПланирования[" + Строка(ВремяПланирования.Индекс(СтрокаВП)) + "].ИнтервалыРаботыПредст", "Объект");
						Возврат Флаг;
					КонецЕсли;	
				КонецЦикла;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Флаг;
	
КонецФункции

#Область МетодыРаботыСДинамическиСоздаваемымиЭлементамиФормы

&НаСервере
// Добавить элементы формы, для нового времени визита
// 
Процедура СоздатьДинамическиеЭлементыПериодовЗаполнения(ИДНовыхЭлементов = Неопределено
	                                                  , НомерСтрокиДанных = Неопределено
													  , Дата = Неопределено
													  , ИнтервалыРаботы = Неопределено)
	
	// Если это добавление элементов формы для новой строки данных
	СтрокаДанных = Неопределено;
	Если ИДНовыхЭлементов = Неопределено Тогда		
		СтрокаДанных                                    = ВремяПланирования.Добавить();
		Если ЗначениеЗаполнено(Дата) Тогда
			Если РежимПланированияРабочихДней = 0 Тогда
				СтрокаДанных.Дата                               = Дата(2001,01,ДеньНедели(Дата));
			Иначе
				СтрокаДанных.Дата                               = Дата;
			КонецЕсли;
		КонецЕсли;
		
		ИДНовыхЭлементов                                = СтрокаДанных.ПолучитьИдентификатор();
		НомерСтрокиДанных                               = ВремяПланирования.Количество() - 1;
		
		ГруппаНовыхЭл                                   = Элементы.Вставить(ПараметрыСозданияЭлементовФормы.ГруппаЭлементов + ИДНовыхЭлементов
		, Тип("ГруппаФормы")
		, Элементы.ГруппаДниЗаполнения
		, Элементы.ГруппаДниЗаполненияЕще);
		
		ГруппаНовыхЭл.Вид                               = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаНовыхЭл.Группировка                       = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ГруппаНовыхЭл.Отображение                       = ОтображениеОбычнойГруппы.Нет;
		ГруппаНовыхЭл.ОтображатьЗаголовок               = Ложь;
	Иначе
		ГруппаНовыхЭл = Элементы.Найти(ПараметрыСозданияЭлементовФормы.ГруппаЭлементов + ИДНовыхЭлементов);
	    СтрокаДанных  = ВремяПланирования.НайтиПоИдентификатору(ИДНовыхЭлементов);	
	КонецЕсли;
	
	// Режим заполнения по конкретным дням
	Если РежимПланированияРабочихДней = 1 ИЛИ РежимПланированияРабочихДней = 2 Тогда
		
		ПолеДень                           	= Элементы.Добавить(ПараметрыСозданияЭлементовФормы.ПолеДня  + ИДНовыхЭлементов, Тип("ПолеФормы"), ГруппаНовыхЭл);
		ПолеДень.Вид                       	= ВидПоляФормы.ПолеВвода;
		ПолеДень.ПоложениеЗаголовка        	= ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеДень.КнопкаВыбора              	= Истина;
		ПолеДень.КнопкаОткрытия            	= Ложь;
		ПолеДень.КнопкаОчистки             	= Ложь;
		ПолеДень.КнопкаРегулирования       	= Ложь;
		ПолеДень.РедактированиеТекста      	= Ложь;		
		ПолеДень.КнопкаСпискаВыбора        	= Ложь;
		ПолеДень.АвтоОтметкаНезаполненного 	= Истина;
		ПолеДень.АвтоМаксимальнаяШирина 	= Ложь;
		ПолеДень.МаксимальнаяШирина        	= 15;
		ПолеДень.Шрифт                     	= Новый Шрифт("Arial",11);
		ПолеДень.ТолькоПросмотр            	= РежимПланированияРабочихДней = 1 И ВремяПланирования.Количество() > 1;
		ПолеДень.ПутьКДанным               	= "ВремяПланирования[" + НомерСтрокиДанных +"].ДатаПредст";
		Если РежимПланированияРабочихДней = 2 Тогда 
			ПолеДень.ТолькоПросмотр 		= Истина;
		Иначе 
			ПолеДень.ТолькоПросмотр 		= Ложь;
		КонецЕсли;	
		ПолеДень.УстановитьДействие("НачалоВыбора", "ПолеДень_НачалоВыбора");	
		
		// Заполняем представления поля периода
		Если ЗначениеЗаполнено(СтрокаДанных.Дата) Тогда
			Если ВремяПланирования.Количество() = 1 Тогда			
				СтрокаДанных.ДатаПредст = 
				ФункцииОтчетовКлиентСервер.ПредставлениеСтандартногоПериода(Новый СтандартныйПериод(СтрокаДанных.Дата,СтрокаДанных.Дата), Перечисления.ДоступныеПериодыОтчета.День);																															   	
			Иначе
				СтрокаДанных.ДатаПредст = Формат(СтрокаДанных.Дата,"ДФ='dd MMMM, dddd'"); 
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли РежимПланированияРабочихДней = 0 Тогда
		
		// Режим заполнения за период
		ПолеДень                           	= Элементы.Добавить(ПараметрыСозданияЭлементовФормы.ПолеДня  + ИДНовыхЭлементов, Тип("ПолеФормы"), ГруппаНовыхЭл);		
		ПолеДень.Вид                       	= ВидПоляФормы.ПолеВвода;
		ПолеДень.ПоложениеЗаголовка        	= ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеДень.ПутьКДанным               	= "ВремяПланирования[" + НомерСтрокиДанных +"].Дата";
		ПолеДень.РежимВыбораИзСписка       	= Истина;
		ПолеДень.КнопкаВыбора              	= Ложь;
		ПолеДень.АвтоОтметкаНезаполненного 	= Истина;
		ПолеДень.АвтоМаксимальнаяШирина 	= Ложь;
		ПолеДень.МаксимальнаяШирина        	= 18;
		ПолеДень.Шрифт                     	= Новый Шрифт("Arial",11);
		ПолеДень.ТолькоПросмотр            	= РежимПланированияРабочихДней = 1 И ВремяПланирования.Количество() > 1;
		ПолеДень.СписокВыбора.Очистить();
			
		ПолеДень.УстановитьДействие("ПриИзменении","ПолеДень_ПриИзменении");
		
		Для Каждого ЭлементМ ИЗ ВремяРаботыСтруктурнойЕдиницы Цикл
			ПолеДень.СписокВыбора.Добавить(ЭлементМ.ДеньНедели, Обработки.ПланированиеИндивидуальногоГрафика.ДеньНеделиПрописью(ДеньНедели(ЭлементМ.ДеньНедели)));
		КонецЦикла;

	КонецЕсли;
	
	// Поле выбора времени
	ПолеВремя                          	= Элементы.Добавить(ПараметрыСозданияЭлементовФормы.ПолеВремени  + ИДНовыхЭлементов, Тип("ПолеФормы"), ГруппаНовыхЭл);													 
	ПолеВремя.Вид                       = ВидПоляФормы.ПолеВвода;
	ПолеВремя.ПоложениеЗаголовка        = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеВремя.ПутьКДанным               = "ВремяПланирования[" + НомерСтрокиДанных +"].ИнтервалыРаботыПредст";
	ПолеВремя.ФорматРедактирования      = "ДФ=HH:mm";
	ПолеВремя.АвтоМаксимальнаяШирина 	= Ложь;
	ПолеВремя.МаксимальнаяШирина        = 37;
	ПолеВремя.КнопкаВыбора              = Истина;
	ПолеВремя.АвтоОтметкаНезаполненного = Истина;
    ПолеВремя.РедактированиеТекста      = Ложь;	
	ПолеВремя.ПодсказкаВвода            = "Интервалы рабочего времени";
	ПолеВремя.КнопкаВыпадающегоСписка   = Истина;
	ПолеВремя.Шрифт                     = Новый Шрифт("Arial",10);
	// Заполнение списка быстрого выбора закешированными данными	
	ЗакешированныеЗначения = ХранилищеСистемныхНастроек.Загрузить("КешированиеВводимыхЗначений", "ИнтервалыВремени");
	Если ЗакешированныеЗначения <> Неопределено Тогда
		Для Каждого ЭлементМ ИЗ ЗакешированныеЗначения Цикл
			Если Не ЗначениеЗаполнено(ЭлементМ) Тогда
				Продолжить;
			КОнецЕсли;
			
			ПолеВремя.СписокВыбора.Добавить(ЭлементМ, Новый ФорматированнаяСтрока(Обработки.ПланированиеИндивидуальногоГрафика.ПредставлениеИнтервалавремени(ЭлементМ), Новый Шрифт("Arial",10)));
			Если ПолеВремя.СписокВыбора.Количество() = 10 Тогда
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;
	КонецЕсли;
	// Если это режим заполнения по дням недели
	Если РежимПланированияРабочихДней = 1 И ВремяПланирования.Количество() > 0 Тогда
		ВремяПланирования[НомерСтрокиДанных].ИнтервалыРаботыПредст = "Не рабочий день";
		ПолеВремя.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		// Если это режим циклического заполнения
		Если ИнтервалыРаботы <> Неопределено Тогда
			СтрокаДанных.ИнтервалыРаботы                    = ИнтервалыРаботы;
			СтрокаДанных.ИнтервалыРаботыПредст              = ПредставлениеИнтервалавремени(ИнтервалыРаботы);
		КонецЕсли;
	КонецЕсли;
	
	ПолеВремя.УстановитьДействие("НачалоВыбора","ПолеВремя_НачалоВыбора");
	ПолеВремя.УстановитьДействие("ОбработкаВыбора","ПолеВремя_ОбработкаВыбора");

		
	// Кнопка удаления строки занятия	
	КнопкаУдаленияВремени                 = Элементы.Добавить(ПараметрыСозданияЭлементовФормы.КнопкаУдаленияЭлементов + ИДНовыхЭлементов
	                                                , Тип("КнопкаФормы")
													, ГруппаНовыхЭл);
	КнопкаУдаленияВремени.ИмяКоманды      = "КомандаУдалитьПериод";
	Если РежимПланированияРабочихДней = 2 Тогда 
		КнопкаУдаленияВремени.Доступность = Ложь;
	КонецЕсли;	
	КнопкаУдаленияВремени.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
    КнопкаУдаленияВремени.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;	
	
КонецПроцедуры

&НаСервере
// Удалить элементы формы связанные с удаляемым временем визита
// 
Процедура УдалитьДинамическиеЭлементыПериодовЗаполнения(ИДСтрокиУдаления)
	
	// При удалении выбранного времени проводим удаление элементов
	// формы и строки в таблице данных т.к. индексы в таблице данных
	// смещаются, необходимо переопределить путь к данным для элементов
	// следующих после удаленных. Сделать это невозможно, поэтому мы вынуждены 
	// создать их заново
	
	МассивИД = Неопределено;
	Если ТипЗнч(ИДСтрокиУдаления) = Тип("Массив") Тогда
		МассивИД = ИДСтрокиУдаления;
	Иначе
		МассивИД = Новый Массив;
		МассивИД.Добавить(ИДСтрокиУдаления);	
	КонецЕсли;	
	
	ИндексСтроки = -1;
	// Удаляем элементы и данные
	Для Каждого ИДДанных ИЗ МассивИД Цикл
		
		ГруппаЭлементов = Элементы.Найти(ПараметрыСозданияЭлементовФормы.ГруппаЭлементов + ИДДанных);
		Элементы.Удалить(ГруппаЭлементов);	
		
		// Ищем строку в данных по ИД
		СтрокаДанных = ВремяПланирования.НайтиПоИдентификатору(ИДДанных);	
		Если СтрокаДанных <> Неопределено Тогда		
			ИндексСтроки = ВремяПланирования.Индекс(СтрокаДанных);
			ВремяПланирования.Удалить(СтрокаДанных);			
		КонецЕсли;
	КонецЦикла;
	
	// Если удаленные данные находилист не вконце таблица
	// необходимо сместить все динамические элементы вверх
	Если ИндексСтроки < ВремяПланирования.Количество() Тогда
		
		// Удаляем нижележащие элементы
		Для А = ИндексСтроки По ВремяПланирования.Количество() - 1 Цикл
			
			ИДЭлементов  = ВремяПланирования[А].ПолучитьИдентификатор();
			
			ПолеФормы = Элементы.Найти(ПараметрыСозданияЭлементовФормы.ПолеДня  + ИДЭлементов);			  
			Элементы.Удалить(ПолеФормы);
			
			ПолеФормы = Элементы.Найти(ПараметрыСозданияЭлементовФормы.ПолеВремени + ИДЭлементов);			  
			Элементы.Удалить(ПолеФормы);
			
			КнопкаФормы = Элементы.Найти(ПараметрыСозданияЭлементовФормы.КнопкаУдаленияЭлементов  + ИДЭлементов);			  
			Элементы.Удалить(КнопкаФормы);		   
		КонецЦикла;
		
		// Создаем элементы взамен удаленных на пред. этапе	  
		Для А = ИндексСтроки По ВремяПланирования.Количество() - 1 Цикл				
			
			ИДЭлементов = ВремяПланирования[А].ПолучитьИдентификатор();								
			СоздатьДинамическиеЭлементыПериодовЗаполнения(ИДЭлементов, А);				
		КонецЦикла;	   
	КонецЕсли;	   
	
КонецПроцедуры

&НаСервере
// Перезагрузить кешь шаблонов интервалов времени
// 
Процедура ОбновитьСпискиБыстрогоВыбораПолейВременныхИнтервалов()
	
	// Заполнение списка быстрого выбора закешированными данными
	ЗакешированныеЗначения = ХранилищеСистемныхНастроек.Загрузить("КешированиеВводимыхЗначений", "ИнтервалыВремени");
	Если ЗакешированныеЗначения <> Неопределено Тогда
		Для Каждого СтрокаТ ИЗ ВремяПланирования Цикл
			ПолеВвода = Элементы.Найти(ПараметрыСозданияЭлементовФормы.ПолеВремени  + СтрокаТ.ПолучитьИдентификатор());
			Если ПолеВвода <> Неопределено Тогда
				ПолеВвода.СписокВыбора.Очистить();
				Для Каждого ЭлементМ ИЗ ЗакешированныеЗначения Цикл
					Если ЭлементМ = неопределено Тогда
						Продолжить;
					КонецЕсли;
					ПолеВвода.СписокВыбора.Добавить(ЭлементМ, Обработки.ПланированиеИндивидуальногоГрафика.ПредставлениеИнтервалавремени(ЭлементМ));
					Если ПолеВвода.СписокВыбора.Количество() = 10 Тогда
						Прервать;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

#Область ОбработчикиДинамическихЭлементов

&НаКлиенте
// Обработчик события изменения знаяения элемента дня недели
// 
Процедура ПолеДень_ПриИзменении(Элемент) 
	
	ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИменеиЭлемента(Элемент.Имя);
	СтрокаДанных   = ВремяПланирования.НайтиПоИдентификатору(ИДСтрокиДанных);
	ПолеВремени    = Элементы.Найти(ПараметрыСозданияЭлементовФормы.ПолеВремени + ИДСтрокиДанных);	
	// Проверям на дублирование дней недели
	Для Каждого СтрокаТ ИЗ ВремяПланирования Цикл
		Если ИДСтрокиДанных <> СтрокаТ.ПолучитьИдентификатор() 
			И ДеньНедели(СтрокаТ.Дата) = ДеньНедели(СтрокаДанных.Дата) Тогда
			
			ПоказатьПредупреждение(,"Нельзя указать два одинаковых дня недели!");
			СтрокаДанных.Дата       = Неопределено;
			СтрокаДанных.ДатаПредст = Неопределено;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
// Обработчик начала выбора дня проведения занятия
// 
Процедура ПолеДень_НачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИдСтрокиДанных = ИдентификаторСтрокиДанныхПоИменеиЭлемента(Элемент.Имя);
	СтрокаДанных   = ВремяПланирования.НайтиПоИдентификатору(ИдСтрокиДанных);
	
	НачалоПериода = ПериодЗаполнения.ДатаНачала;
	Если НачалоПериода = '00010101' тогда
		НачалоПериода = ФункцииОтчетовКлиентСервер.НачалоПериодаОтчета("Перечисление.ДоступныеПериодыОтчета.День", ОбщегоНазначенияКлиент.ДатаСеанса());
	КонецЕсли;
	
	ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День");
	
	// Выбор периода из выпадающего списка
	Оповещение = Новый ОписаниеОповещения("ПолеДень_КонецВыбораОповещение", ЭтаФорма, Новый Структура("ВидПериода,СтрокаДанных", ВидПериода, СтрокаДанных));
	ВыбратьПериодИзВыпадающегоСписка(Элемент, ВидПериода, НачалоПериода, ПериодЗаполнения.Вариант, Неопределено, Оповещение);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Поле день конец выбора оповещение
// 
Процедура ПолеДень_КонецВыбораОповещение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяДата = Неопределено;
	Если ТипЗнч(РезультатВыбора.Значение) = Тип("ВариантСтандартногоПериода") Тогда
		Если РезультатВыбора.Значение = ПредопределенноеЗначение("ВариантСтандартногоПериода.Сегодня") Тогда
			ВыбраннаяДата = ТекущаяДата();
		ИначеЕсли РезультатВыбора.Значение = ПредопределенноеЗначение("ВариантСтандартногоПериода.Вчера") Тогда
			ВыбраннаяДата = ТекущаяДата() - 86400;
		ИначеЕсли РезультатВыбора.Значение = ПредопределенноеЗначение("ВариантСтандартногоПериода.Завтра") Тогда
			ВыбраннаяДата = ТекущаяДата() + 86400;
		КонецЕсли;
	Иначе
		ВыбраннаяДата = ФункцииОтчетовКлиентСервер.НачалоПериодаОтчета(ДопПараметры.ВидПериода, РезультатВыбора.Значение);
	КонецЕсли;
	
	// Проверям входит ли день в рабочие дни
	Если ПроверитьВхождениеПериодаВРабочиеДни(ВыбраннаяДата) = Ложь Тогда
		ПоказатьПредупреждение(,"Выбранный день является не рабочим");
		Возврат;
	КонецЕсли;	
	
	ДопПараметры.СтрокаДанных.ДатаПредст     = ?(ПустаяСтрока(РезультатВыбора.Представление), Строка(РезультатВыбора.Значение), РезультатВыбора.Представление);
	ДопПараметры.СтрокаДанных.Дата           = ВыбраннаяДата;
	                                         
	// Если исп. циклический режим заполнения(смены)
	// при смене даты первого дня необходимо сместить следующие дни в цикле
	Если РежимПланированияРабочихДней = 1 Тогда
		Для А = 1 По ВремяПланирования.Количество() -1 Цикл
			ВремяПланирования[А].Дата       = ВремяПланирования[А - 1].Дата + 86400;
			ВремяПланирования[А].ДатаПредст =  Формат(ВремяПланирования[А].Дата,"ДФ='dd MMMM, dddd'");
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик события начала выбора времени занятия
// 
Процедура ПолеВремя_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИменеиЭлемента(Элемент.Имя);
	СтрокаДанных   = ВремяПланирования.НайтиПоИдентификатору(ИДСтрокиДанных);
	Если НЕ ЗначениеЗаполнено(СтрокаДанных.Дата) Тогда
		ПоказатьПредупреждение(,"Выберите рабочий день");
		Возврат;
	КонецЕсли;	
		
	ПарамФормы = Новый Структура("ДатаДня,ИнтервалыРаботы", СтрокаДанных.Дата, СтрокаДанных.ИнтервалыРаботы);
	Оповещение = Новый ОписаниеОповещения("ПолеВремя_ОкончаниеВыбора", ЭтотОбъект, Новый Структура("СтрокаДанных", СтрокаДанных));
	ОткрытьФорму("Обработка.ПланированиеИндивидуальногоГрафика.Форма.ФормаПодбораИнтерваловВремени",ПарамФормы, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Поле время окончание выбора
// 
// Параметры:
//  РезВыбора	 - 	 - 
//  ДопПараметры - 	 - 
// 
Процедура  ПолеВремя_ОкончаниеВыбора(РезВыбора, ДопПараметры) Экспорт	
	
	Если РезВыбора <> Неопределено Тогда
		ДопПараметры.СтрокаДанных.ИнтервалыРаботы       = РезВыбора;
		ДопПараметры.СтрокаДанных.ИнтервалыРаботыПредст = ПредставлениеИнтервалавремени(РезВыбора); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик выбора значения
// 
Процедура ПолеВремя_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИменеиЭлемента(Элемент.Имя);
	СтрокаДанных   = ВремяПланирования.НайтиПоИдентификатору(ИДСтрокиДанных);
	Если ВыбранноеЗначение <> Неопределено Тогда
		СтрокаДанных.ИнтервалыРаботы       = ВыбранноеЗначение;
		СтрокаДанных.ИнтервалыРаботыПредст = ПредставлениеИнтервалавремени(ВыбранноеЗначение); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик кнопки удаления времени занятия
// 
Процедура КомандаУдалитьВремяЗаполнения(Команда)
		
	ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИменеиЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);	
	// Проверка возможности операции	
	Если ВремяПланирования.Количество() = 1 Тогда
		ПоказатьПредупреждение(,"Необходимо оставить хотя бы одно значение периода заполнения!");
		Возврат;
	КонецЕсли;
	Если РежимПланированияРабочихДней = 1 И ИДСтрокиДанных = ВремяПланирования[0].ПолучитьИдентификатор() Тогда
		ПоказатьПредупреждение(,"В режиме циклического заполнения периодов, нельзя удалять первую строку начала периода!");
		Возврат;		
	КонецЕсли;
	
	УдалитьДинамическиеЭлементыПериодовЗаполнения(ИДСтрокиДанных);
	
	// Если исп. циклический режим заполнения(смены)
	// При удаленой одной из строк периода, необходимо перезаполнить оставшиеся строки
	Если РежимПланированияРабочихДней = 1 Тогда
		Для А = 1 По ВремяПланирования.Количество() -1 Цикл
			ВремяПланирования[А].Дата       = ВремяПланирования[А - 1].Дата + 86400;
			ВремяПланирования[А].ДатаПредст = Формат(ВремяПланирования[А].Дата,"ДФ='dd MMMM, dddd'");
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
// Выбрать период из спсика
// 
Процедура ВыбратьПериодИзВыпадающегоСписка(Элемент, ВидПериода, НачалоПериода, Вариант, ИндексНачальногоЗначения, ОповещениеВладельца)
	
	Если Вариант = Неопределено Или Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		СписокПериодов = ФункцииОтчетовКлиентСервер.СписокФиксированныхПериодов(НачалоПериода, ВидПериода);
		СписокПериодов.Добавить("ВыборАвтоматическиВычисляемогоПериода", НСтр("ru = 'Относительный...'"));
		Если ИндексНачальногоЗначения = Неопределено Тогда
			ИндексНачальногоЗначения = СписокПериодов.НайтиПоЗначению(НачалоПериода);
		КонецЕсли;
	Иначе
		СписокПериодов = ФункцииОтчетовКлиентСервер.СписокВычисляемыхПериодов(ВидПериода);
		СписокПериодов.Добавить("ВыборФиксированногоПериода", НСтр("ru = 'Фиксированный...'"));
		Если ИндексНачальногоЗначения = Неопределено Тогда
			ИндексНачальногоЗначения = СписокПериодов.НайтиПоЗначению(Вариант);
		КонецЕсли;
	КонецЕсли;
	Если ИндексНачальногоЗначения = Неопределено Тогда
		ИндексНачальногоЗначения = СписокПериодов.Количество() - 1;
	КонецЕсли;
	
	ДопПараметры =  Новый Структура("ОповещениеВладельца,ВидПериода,НачалоПериода,Элемент,СписокПериодов,Вариант", ОповещениеВладельца, ВидПериода, НачалоПериода, Элемент, СписокПериодов,Вариант);
	Оповещение   = Новый ОписаниеОповещения("ПослеВыбораИзСпискапериодаОповещение", ЭтаФорма, ДопПараметры);
	ПоказатьВыборИзСписка(Оповещение, СписокПериодов, Элемент, ИндексНачальногоЗначения);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора из спискапериода оповещение
// 
// Параметры:
//  РезультатВыбора	 - 	 - 
//  ДопПараметры	 - 	 - 
// 
Процедура ПослеВыбораИзСпискапериодаОповещение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДопПараметры.ОповещениеВладельца, Неопределено);
		Возврат;		
	ИначеЕсли ТипЗнч(РезультатВыбора.Значение) = Тип("ВариантСтандартногоПериода") Тогда
		ВыполнитьОбработкуОповещения(ДопПараметры.ОповещениеВладельца, РезультатВыбора);
		Возврат;	
	ИначеЕсли РезультатВыбора.Значение = "ВыборАвтоматическиВычисляемогоПериода" Тогда
		ВариантКопия = ВариантСтандартногоПериодаПоВиду(ДопПараметры.ВидПериода);
		ВыбратьПериодИзВыпадающегоСписка(ДопПараметры.Элемент, ДопПараметры.ВидПериода, ДопПараметры.НачалоПериода, ВариантКопия, Неопределено,ДопПараметры.ОповещениеВладельца);
		Возврат;		
	ИначеЕсли РезультатВыбора.Значение = "ВыборФиксированногоПериода" Тогда
		ВыбратьПериодИзВыпадающегоСписка(ДопПараметры.Элемент, ДопПараметры.ВидПериода, ДопПараметры.НачалоПериода, Неопределено, Неопределено,ДопПараметры.ОповещениеВладельца);
		Возврат;
	КонецЕсли;
	
	Индекс = ДопПараметры.СписокПериодов.Индекс(РезультатВыбора);
	Если Индекс = 0 Или Индекс = ДопПараметры.СписокПериодов.Количество() - 2 Тогда
		ВыбратьПериодИзВыпадающегоСписка(ДопПараметры.Элемент, ДопПараметры.ВидПериода, РезультатВыбора.Значение, ДопПараметры.Вариант, Индекс, ДопПараметры.ОповещениеВладельца);
		Возврат;	
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДопПараметры.ОповещениеВладельца, РезультатВыбора);
КонецПроцедуры

&НаКлиенте
// Получить соответсвия вариантов периода
Функция ВариантСтандартногоПериодаПоВиду(ВидПериода)
	Если ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День") Тогда
		Возврат ВариантСтандартногоПериода.Сегодня;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Неделя") Тогда
		Возврат ВариантСтандартногоПериода.ЭтаНеделя;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Декада") Тогда
		Возврат ВариантСтандартногоПериода.ЭтаДекада;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотМесяц;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Квартал") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотКвартал;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Полугодие") Тогда
		Возврат ВариантСтандартногоПериода.ЭтоПолугодие;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Год") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотГод;
	КонецЕсли;
КонецФункции

&НаКлиенте
// Функция вернет идентификатор строки данных по имени элемента
// 
Функция ИдентификаторСтрокиДанныхПоИменеиЭлемента(ИмяЭлемента)
   НомерСимвола = Найти(ИмяЭлемента,"_");
   Возврат Число(Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента) - НомерСимвола )); 
КонецФункции

&НаКлиенте
// Проверить вхождение указанного периода в рабочие дни
// 
Функция ПроверитьВхождениеПериодаВРабочиеДни(Период)
	
	Для Каждого ЭлементМ ИЗ ВремяРаботыСтруктурнойЕдиницы Цикл
		Если ДеньНедели(ЭлементМ.ДеньНедели) = ДеньНедели(Период) Тогда
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла;

	Возврат Ложь;
КонецФункции	

&НаКлиенте
// Функция вернет следующий рабочий день
// 
Функция СледующийРабочийДень()
	
	Если ВремяПланирования.Количество() > 0 Тогда
		СтрокаДанных  = ВремяПланирования[ВремяПланирования.Количество() - 1];
		СледующаяДата = СтрокаДанных.Дата + 86400;
		Счетчик       = 0;
		Пока ПроверитьВхождениеПериодаВРабочиеДни(СледующаяДата) = Ложь Цикл			
			СледующаяДата = СледующаяДата + 86400;
			// Проверка антизацикливания
			Счетчик = Счетчик + 1;
			Если Счетчик = 7 Тогда
				Возврат Неопределено;
			КонецЕсли;	
		КонецЦикла;
		Возврат СледующаяДата;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаКлиенте
// Получить последнее выбранное время функции
Функция ПоследниеВыбранныеИнтервалыВремени()
	Если ВремяПланирования.Количество() > 0
	   И ВремяПланирования[ВремяПланирования.Количество() - 1].ИнтервалыРаботы.Количество() > 0 Тогда
	   
	   Возврат ВремяПланирования[ВремяПланирования.Количество() - 1].ИнтервалыРаботы; 
	Иначе
		Возврат Неопределено;
	КонецЕсли;		
КонецФункции

&НаКлиенте
// Вернуть сумму интервалов времени в минутах
// 
Функция СуммаИнтерваловВМинутах(СписокИнтервала)
	
	СуммМинут                 = 0;
	Для Каждого ЭлементС ИЗ СписокИнтервала Цикл
		СуммМинут = СуммМинут + Цел((ЭлементС.Значение.ОкончаниеРаботы - ЭлементС.Значение.НачалоРаботы) / 60);	
	КонецЦикла;
	
	Возврат СуммМинут;
	
КонецФункции

&НаСервереБезКонтекста
// Получить представлениеинтервалов времени
// 
Функция ПредставлениеИнтервалавремени(СписокИнтервала)	
	Возврат Обработки.ПланированиеИндивидуальногоГрафика.ПредставлениеИнтервалавремени(СписокИнтервала);	
КонецФункции

#КонецОбласти

#КонецОбласти
